public/man/man1/lsipc.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - lsipc.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - lsipc.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>lsipc - show information on IPC facilities currently employed in the
system</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>lsipc</strong> [options]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>lsipc</strong> shows information on the System V inter-process communication
facilities for which the calling process has read access.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-i</strong>, <strong>–id</strong> <em>id</em></p>
<blockquote>
<p>Show full details on just the one resource element identified by <em>id</em>.
This option needs to be combined with one of the three resource options:
<strong>-m</strong>, <strong>-q</strong> or <strong>-s</strong>. It is possible to override the default output format
for this option with the <strong>–list</strong>, <strong>–raw</strong>, <strong>–json</strong> or <strong>–export</strong>
option.</p>
</blockquote>
<p>
<strong>-g</strong>, <strong>–global</strong></p>
<blockquote>
<p>Show system-wide usage and limits of IPC resources. This option may be
combined with one of the three resource options: <strong>-m</strong>, <strong>-q</strong> or <strong>-s</strong>. The
default is to show information about all resources.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help text and exit.</p>
</blockquote>
<p>
<strong>-V</strong>, <strong>–version</strong></p>
<blockquote>
<p>Print version and exit.</p>
</blockquote>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Resource options
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p><strong>-m</strong>, <strong>–shmems</strong></p>
<blockquote>
<p>Write information about active shared memory segments.</p>
</blockquote>
<p>
<strong>-q</strong>, <strong>–queues</strong></p>
<blockquote>
<p>Write information about active message queues.</p>
</blockquote>
<p>
<strong>-s</strong>, <strong>–semaphores</strong></p>
<blockquote>
<p>Write information about active semaphore sets.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Output formatting
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p><strong>-c</strong>, <strong>–creator</strong></p>
<blockquote>
<p>Show creator and owner.</p>
</blockquote>
<p>
<strong>-e</strong>, <strong>–export</strong></p>
<blockquote>
<p>Produce output in the form of key=&#34;value&#34; pairs. All potentially unsafe
value characters are hex-escaped (\x&lt;code&gt;). See also option <strong>–shell</strong>.</p>
</blockquote>
<p>
<strong>-J</strong>, <strong>–json</strong></p>
<blockquote>
<p>Use the JSON output format.</p>
</blockquote>
<p>
<strong>-l</strong>, <strong>–list</strong></p>
<blockquote>
<p>Use the list output format. This is the default, except when <strong>–id</strong> is
used.</p>
</blockquote>
<p>
<strong>-n</strong>, <strong>–newline</strong></p>
<blockquote>
<p>Display each piece of information on a separate line.</p>
</blockquote>
<p>
<strong>–noheadings</strong></p>
<blockquote>
<p>Do not print a header line.</p>
</blockquote>
<p>
<strong>–notruncate</strong></p>
<blockquote>
<p>Don&#39;t truncate output.</p>
</blockquote>
<p>
<strong>-o</strong>, <strong>–output</strong> <em>list</em></p>
<blockquote>
<p>Specify which output columns to print. Use <strong>–help</strong> to get a list of all
supported columns.</p>
</blockquote>
<p>
<strong>-b</strong>, <strong>–bytes</strong></p>
<blockquote>
<p>Print size in bytes rather than in human readable format.</p>
</blockquote>
<p>
<strong>-r</strong>, <strong>–raw</strong></p>
<blockquote>
<p>Raw output (no columnation).</p>
</blockquote>
<p>
<strong>-t</strong>, <strong>–time</strong></p>
<blockquote>
<p>Write time information. The time of the last control operation that
changed the access permissions for all facilities, the time of the last
*msgsnd*(2) and *msgrcv*(2) operations on message queues, the time of
the last *shmat*(2) and *shmdt*(2) operations on shared memory, and the
time of the last *semop*(2) operation on semaphores.</p>
</blockquote>
<p>
<strong>–time-format</strong> <em>type</em></p>
<blockquote>
<p>Display dates in short, full or iso format. The default is short, this
time format is designed to be space efficient and human readable.</p>
</blockquote>
<p>
<strong>-P</strong>, <strong>–numeric-perms</strong></p>
<blockquote>
<p>Print numeric permissions in PERMS column.</p>
</blockquote>
<p>
<strong>-y</strong>, <strong>–shell</strong></p>
<blockquote>
<p>The column name will be modified to contain only characters allowed for
shell variable identifiers. This is usable, for example, with
<strong>–export</strong>. Note that this feature has been automatically enabled for
<strong>–export</strong> in version 2.37, but due to compatibility issues, now it&#39;s
necessary to request this behavior by <strong>–shell</strong>.</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
EXIT STATUS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>0</p>
<blockquote>
<p>if OK,</p>
</blockquote>
<p>
1</p>
<blockquote>
<p>if incorrect arguments specified,</p>
</blockquote>
<p>
2</p>
<blockquote>
<p>if a serious error occurs.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
HISTORY
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>The <strong>lsipc</strong> utility is inspired by the *ipcs*(1) utility.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
AUTHORS
</h2>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
SEE ALSO
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>*ipcmk*(1), *ipcrm*(1), *msgrcv*(2), *msgsnd*(2), *semget*(2),
*semop*(2), *shmat*(2), *shmdt*(2), *shmget*(2), *sysvipc*(7)</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
REPORTING BUGS
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>For bug reports, use the issue tracker at
&lt;<a href="https://github.com/util-linux/util-linux/issues">https://github.com/util-linux/util-linux/issues</a>&gt;.</p>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
AVAILABILITY
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>The <strong>lsipc</strong> command is part of the util-linux package which can be
downloaded from <em>Linux Kernel Archive</em>
&lt;<a href="https://www.kernel.org/pub/linux/utils/util-linux/">https://www.kernel.org/pub/linux/utils/util-linux/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
